dturcu/illd_release_tc3x/src/BaseSw/Infra/Sfr/TC37xED/IfxGeth_bf.h
/** \brief Length for Ifx_GETH_MAC_RX_TX_STATUS_Bits.EXDEF */
#define IFX_GETH_MAC_RX_TX_STATUS_EXDEF_LEN (1u)

/** \brief Mask for Ifx_GETH_MAC_RX_TX_STATUS_Bits.EXDEF */
#define IFX_GETH_MAC_RX_TX_STATUS_EXDEF_MSK (0x1u)

/** \brief Offset for Ifx_GETH_MAC_RX_TX_STATUS_Bits.EXDEF */
#define IFX_GETH_MAC_RX_TX_STATUS_EXDEF_OFF (3u)

/** \brief Length for Ifx_GETH_MAC_RX_TX_STATUS_Bits.LCOL */
#define IFX_GETH_MAC_RX_TX_STATUS_LCOL_LEN (1u)

/** \brief Mask for Ifx_GETH_MAC_RX_TX_STATUS_Bits.LCOL */
#define IFX_GETH_MAC_RX_TX_STATUS_LCOL_MSK (0x1u)

/** \brief Offset for Ifx_GETH_MAC_RX_TX_STATUS_Bits.LCOL */
#define IFX_GETH_MAC_RX_TX_STATUS_LCOL_OFF (4u)

/** \brief Length for Ifx_GETH_MAC_RX_TX_STATUS_Bits.EXCOL */
#define IFX_GETH_MAC_RX_TX_STATUS_EXCOL_LEN (1u)

/** \brief Mask for Ifx_GETH_MAC_RX_TX_STATUS_Bits.EXCOL */
#define IFX_GETH_MAC_RX_TX_STATUS_EXCOL_MSK (0x1u)

/** \brief Offset for Ifx_GETH_MAC_RX_TX_STATUS_Bits.EXCOL */
#define IFX_GETH_MAC_RX_TX_STATUS_EXCOL_OFF (5u)

/** \brief Length for Ifx_GETH_MAC_RX_TX_STATUS_Bits.RWT */
#define IFX_GETH_MAC_RX_TX_STATUS_RWT_LEN (1u)

/** \brief Mask for Ifx_GETH_MAC_RX_TX_STATUS_Bits.RWT */
#define IFX_GETH_MAC_RX_TX_STATUS_RWT_MSK (0x1u)

/** \brief Offset for Ifx_GETH_MAC_RX_TX_STATUS_Bits.RWT */
#define IFX_GETH_MAC_RX_TX_STATUS_RWT_OFF (8u)

/** \brief Length for Ifx_GETH_MAC_PMT_CONTROL_STATUS_Bits.PWRDWN */
#define IFX_GETH_MAC_PMT_CONTROL_STATUS_PWRDWN_LEN (1u)

/** \brief Mask for Ifx_GETH_MAC_PMT_CONTROL_STATUS_Bits.PWRDWN */
#define IFX_GETH_MAC_PMT_CONTROL_STATUS_PWRDWN_MSK (0x1u)

/** \brief Offset for Ifx_GETH_MAC_PMT_CONTROL_STATUS_Bits.PWRDWN */
#define IFX_GETH_MAC_PMT_CONTROL_STATUS_PWRDWN_OFF (0u)

/** \brief Length for Ifx_GETH_MAC_PMT_CONTROL_STATUS_Bits.MGKPKTEN */
#define IFX_GETH_MAC_PMT_CONTROL_STATUS_MGKPKTEN_LEN (1u)

/** \brief Mask for Ifx_GETH_MAC_PMT_CONTROL_STATUS_Bits.MGKPKTEN */
#define IFX_GETH_MAC_PMT_CONTROL_STATUS_MGKPKTEN_MSK (0x1u)

/** \brief Offset for Ifx_GETH_MAC_PMT_CONTROL_STATUS_Bits.MGKPKTEN */
#define IFX_GETH_MAC_PMT_CONTROL_STATUS_MGKPKTEN_OFF (1u)

/** \brief Length for Ifx_GETH_MAC_PMT_CONTROL_STATUS_Bits.RWKPKTEN */
#define IFX_GETH_MAC_PMT_CONTROL_STATUS_RWKPKTEN_LEN (1u)

/** \brief Mask for Ifx_GETH_MAC_PMT_CONTROL_STATUS_Bits.RWKPKTEN */
#define IFX_GETH_MAC_PMT_CONTROL_STATUS_RWKPKTEN_MSK (0x1u)

/** \brief Offset for Ifx_GETH_MAC_PMT_CONTROL_STATUS_Bits.RWKPKTEN */
#define IFX_GETH_MAC_PMT_CONTROL_STATUS_RWKPKTEN_OFF (2u)

/** \brief Length for Ifx_GETH_MAC_PMT_CONTROL_STATUS_Bits.MGKPRCVD */
#define IFX_GETH_MAC_PMT_CONTROL_STATUS_MGKPRCVD_LEN (1u)

/** \brief Mask for Ifx_GETH_MAC_PMT_CONTROL_STATUS_Bits.MGKPRCVD */
#define IFX_GETH_MAC_PMT_CONTROL_STATUS_MGKPRCVD_MSK (0x1u)

/** \brief Offset for Ifx_GETH_MAC_PMT_CONTROL_STATUS_Bits.MGKPRCVD */
#define IFX_GETH_MAC_PMT_CONTROL_STATUS_MGKPRCVD_OFF (5u)

/** \brief Length for Ifx_GETH_MAC_PMT_CONTROL_STATUS_Bits.RWKPRCVD */
#define IFX_GETH_MAC_PMT_CONTROL_STATUS_RWKPRCVD_LEN (1u)

/** \brief Mask for Ifx_GETH_MAC_PMT_CONTROL_STATUS_Bits.RWKPRCVD */
#define IFX_GETH_MAC_PMT_CONTROL_STATUS_RWKPRCVD_MSK (0x1u)

/** \brief Offset for Ifx_GETH_MAC_PMT_CONTROL_STATUS_Bits.RWKPRCVD */
#define IFX_GETH_MAC_PMT_CONTROL_STATUS_RWKPRCVD_OFF (6u)

/** \brief Length for Ifx_GETH_MAC_PMT_CONTROL_STATUS_Bits.GLBLUCAST */
#define IFX_GETH_MAC_PMT_CONTROL_STATUS_GLBLUCAST_LEN (1u)

/** \brief Mask for Ifx_GETH_MAC_PMT_CONTROL_STATUS_Bits.GLBLUCAST */
#define IFX_GETH_MAC_PMT_CONTROL_STATUS_GLBLUCAST_MSK (0x1u)

/** \brief Offset for Ifx_GETH_MAC_PMT_CONTROL_STATUS_Bits.GLBLUCAST */
#define IFX_GETH_MAC_PMT_CONTROL_STATUS_GLBLUCAST_OFF (9u)

/** \brief Length for Ifx_GETH_MAC_PMT_CONTROL_STATUS_Bits.RWKPFE */
#define IFX_GETH_MAC_PMT_CONTROL_STATUS_RWKPFE_LEN (1u)

/** \brief Mask for Ifx_GETH_MAC_PMT_CONTROL_STATUS_Bits.RWKPFE */
#define IFX_GETH_MAC_PMT_CONTROL_STATUS_RWKPFE_MSK (0x1u)

/** \brief Offset for Ifx_GETH_MAC_PMT_CONTROL_STATUS_Bits.RWKPFE */
#define IFX_GETH_MAC_PMT_CONTROL_STATUS_RWKPFE_OFF (10u)

/** \brief Length for Ifx_GETH_MAC_PMT_CONTROL_STATUS_Bits.RWKPTR */
#define IFX_GETH_MAC_PMT_CONTROL_STATUS_RWKPTR_LEN (5u)

/** \brief Mask for Ifx_GETH_MAC_PMT_CONTROL_STATUS_Bits.RWKPTR */
#define IFX_GETH_MAC_PMT_CONTROL_STATUS_RWKPTR_MSK (0x1fu)

/** \brief Offset for Ifx_GETH_MAC_PMT_CONTROL_STATUS_Bits.RWKPTR */
#define IFX_GETH_MAC_PMT_CONTROL_STATUS_RWKPTR_OFF (24u)

/** \brief Length for Ifx_GETH_MAC_PMT_CONTROL_STATUS_Bits.RWKFILTRST */
#define IFX_GETH_MAC_PMT_CONTROL_STATUS_RWKFILTRST_LEN (1u)

/** \brief Mask for Ifx_GETH_MAC_PMT_CONTROL_STATUS_Bits.RWKFILTRST */
#define IFX_GETH_MAC_PMT_CONTROL_STATUS_RWKFILTRST_MSK (0x1u)

/** \brief Offset for Ifx_GETH_MAC_PMT_CONTROL_STATUS_Bits.RWKFILTRST */
#define IFX_GETH_MAC_PMT_CONTROL_STATUS_RWKFILTRST_OFF (31u)

/** \brief Length for Ifx_GETH_MAC_RWK_PACKET_FILTER_Bits.WKUPFRMFTR */
#define IFX_GETH_MAC_RWK_PACKET_FILTER_WKUPFRMFTR_LEN (32u)

/** \brief Mask for Ifx_GETH_MAC_RWK_PACKET_FILTER_Bits.WKUPFRMFTR */
#define IFX_GETH_MAC_RWK_PACKET_FILTER_WKUPFRMFTR_MSK (0xffffffffu)

/** \brief Offset for Ifx_GETH_MAC_RWK_PACKET_FILTER_Bits.WKUPFRMFTR */
#define IFX_GETH_MAC_RWK_PACKET_FILTER_WKUPFRMFTR_OFF (0u)

/** \brief Length for Ifx_GETH_RWK_FILTER_COMMAND_0_Bits.Filter0_Command */
#define IFX_GETH_RWK_FILTER_COMMAND_0_FILTER0_COMMAND_LEN (4u)

/** \brief Mask for Ifx_GETH_RWK_FILTER_COMMAND_0_Bits.Filter0_Command */
#define IFX_GETH_RWK_FILTER_COMMAND_0_FILTER0_COMMAND_MSK (0xfu)

/** \brief Offset for Ifx_GETH_RWK_FILTER_COMMAND_0_Bits.Filter0_Command */
#define IFX_GETH_RWK_FILTER_COMMAND_0_FILTER0_COMMAND_OFF (0u)

/** \brief Length for Ifx_GETH_RWK_FILTER_COMMAND_0_Bits.Filter1_Command */
#define IFX_GETH_RWK_FILTER_COMMAND_0_FILTER1_COMMAND_LEN (4u)

/** \brief Mask for Ifx_GETH_RWK_FILTER_COMMAND_0_Bits.Filter1_Command */
#define IFX_GETH_RWK_FILTER_COMMAND_0_FILTER1_COMMAND_MSK (0xfu)

/** \brief Offset for Ifx_GETH_RWK_FILTER_COMMAND_0_Bits.Filter1_Command */
#define IFX_GETH_RWK_FILTER_COMMAND_0_FILTER1_COMMAND_OFF (8u)

/** \brief Length for Ifx_GETH_RWK_FILTER_COMMAND_0_Bits.Filter2_Command */
#define IFX_GETH_RWK_FILTER_COMMAND_0_FILTER2_COMMAND_LEN (4u)

