dturcu/illd_release_tc3x/src/BaseSw/Infra/Sfr/TC37xED/IfxGeth_bf.h
/** \brief Length for Ifx_GETH_MMC_CONTROL_Bits.CNTSTOPRO */
#define IFX_GETH_MMC_CONTROL_CNTSTOPRO_LEN (1u)

/** \brief Mask for Ifx_GETH_MMC_CONTROL_Bits.CNTSTOPRO */
#define IFX_GETH_MMC_CONTROL_CNTSTOPRO_MSK (0x1u)

/** \brief Offset for Ifx_GETH_MMC_CONTROL_Bits.CNTSTOPRO */
#define IFX_GETH_MMC_CONTROL_CNTSTOPRO_OFF (1u)

/** \brief Length for Ifx_GETH_MMC_CONTROL_Bits.RSTONRD */
#define IFX_GETH_MMC_CONTROL_RSTONRD_LEN (1u)

/** \brief Mask for Ifx_GETH_MMC_CONTROL_Bits.RSTONRD */
#define IFX_GETH_MMC_CONTROL_RSTONRD_MSK (0x1u)

/** \brief Offset for Ifx_GETH_MMC_CONTROL_Bits.RSTONRD */
#define IFX_GETH_MMC_CONTROL_RSTONRD_OFF (2u)

/** \brief Length for Ifx_GETH_MMC_CONTROL_Bits.CNTFREEZ */
#define IFX_GETH_MMC_CONTROL_CNTFREEZ_LEN (1u)

/** \brief Mask for Ifx_GETH_MMC_CONTROL_Bits.CNTFREEZ */
#define IFX_GETH_MMC_CONTROL_CNTFREEZ_MSK (0x1u)

/** \brief Offset for Ifx_GETH_MMC_CONTROL_Bits.CNTFREEZ */
#define IFX_GETH_MMC_CONTROL_CNTFREEZ_OFF (3u)

/** \brief Length for Ifx_GETH_MMC_CONTROL_Bits.CNTPRST */
#define IFX_GETH_MMC_CONTROL_CNTPRST_LEN (1u)

/** \brief Mask for Ifx_GETH_MMC_CONTROL_Bits.CNTPRST */
#define IFX_GETH_MMC_CONTROL_CNTPRST_MSK (0x1u)

/** \brief Offset for Ifx_GETH_MMC_CONTROL_Bits.CNTPRST */
#define IFX_GETH_MMC_CONTROL_CNTPRST_OFF (4u)

/** \brief Length for Ifx_GETH_MMC_CONTROL_Bits.CNTPRSTLVL */
#define IFX_GETH_MMC_CONTROL_CNTPRSTLVL_LEN (1u)

/** \brief Mask for Ifx_GETH_MMC_CONTROL_Bits.CNTPRSTLVL */
#define IFX_GETH_MMC_CONTROL_CNTPRSTLVL_MSK (0x1u)

/** \brief Offset for Ifx_GETH_MMC_CONTROL_Bits.CNTPRSTLVL */
#define IFX_GETH_MMC_CONTROL_CNTPRSTLVL_OFF (5u)

/** \brief Length for Ifx_GETH_MMC_CONTROL_Bits.UCDBC */
#define IFX_GETH_MMC_CONTROL_UCDBC_LEN (1u)

/** \brief Mask for Ifx_GETH_MMC_CONTROL_Bits.UCDBC */
#define IFX_GETH_MMC_CONTROL_UCDBC_MSK (0x1u)

/** \brief Offset for Ifx_GETH_MMC_CONTROL_Bits.UCDBC */
#define IFX_GETH_MMC_CONTROL_UCDBC_OFF (8u)

/** \brief Length for Ifx_GETH_MMC_RX_INTERRUPT_Bits.RXGBPKTIS */
#define IFX_GETH_MMC_RX_INTERRUPT_RXGBPKTIS_LEN (1u)

/** \brief Mask for Ifx_GETH_MMC_RX_INTERRUPT_Bits.RXGBPKTIS */
#define IFX_GETH_MMC_RX_INTERRUPT_RXGBPKTIS_MSK (0x1u)

/** \brief Offset for Ifx_GETH_MMC_RX_INTERRUPT_Bits.RXGBPKTIS */
#define IFX_GETH_MMC_RX_INTERRUPT_RXGBPKTIS_OFF (0u)

/** \brief Length for Ifx_GETH_MMC_RX_INTERRUPT_Bits.RXGBOCTIS */
#define IFX_GETH_MMC_RX_INTERRUPT_RXGBOCTIS_LEN (1u)

/** \brief Mask for Ifx_GETH_MMC_RX_INTERRUPT_Bits.RXGBOCTIS */
#define IFX_GETH_MMC_RX_INTERRUPT_RXGBOCTIS_MSK (0x1u)

/** \brief Offset for Ifx_GETH_MMC_RX_INTERRUPT_Bits.RXGBOCTIS */
#define IFX_GETH_MMC_RX_INTERRUPT_RXGBOCTIS_OFF (1u)

/** \brief Length for Ifx_GETH_MMC_RX_INTERRUPT_Bits.RXGOCTIS */
#define IFX_GETH_MMC_RX_INTERRUPT_RXGOCTIS_LEN (1u)

/** \brief Mask for Ifx_GETH_MMC_RX_INTERRUPT_Bits.RXGOCTIS */
#define IFX_GETH_MMC_RX_INTERRUPT_RXGOCTIS_MSK (0x1u)

/** \brief Offset for Ifx_GETH_MMC_RX_INTERRUPT_Bits.RXGOCTIS */
#define IFX_GETH_MMC_RX_INTERRUPT_RXGOCTIS_OFF (2u)

/** \brief Length for Ifx_GETH_MMC_RX_INTERRUPT_Bits.RXBCGPIS */
#define IFX_GETH_MMC_RX_INTERRUPT_RXBCGPIS_LEN (1u)

/** \brief Mask for Ifx_GETH_MMC_RX_INTERRUPT_Bits.RXBCGPIS */
#define IFX_GETH_MMC_RX_INTERRUPT_RXBCGPIS_MSK (0x1u)

/** \brief Offset for Ifx_GETH_MMC_RX_INTERRUPT_Bits.RXBCGPIS */
#define IFX_GETH_MMC_RX_INTERRUPT_RXBCGPIS_OFF (3u)

/** \brief Length for Ifx_GETH_MMC_RX_INTERRUPT_Bits.RXMCGPIS */
#define IFX_GETH_MMC_RX_INTERRUPT_RXMCGPIS_LEN (1u)

/** \brief Mask for Ifx_GETH_MMC_RX_INTERRUPT_Bits.RXMCGPIS */
#define IFX_GETH_MMC_RX_INTERRUPT_RXMCGPIS_MSK (0x1u)

/** \brief Offset for Ifx_GETH_MMC_RX_INTERRUPT_Bits.RXMCGPIS */
#define IFX_GETH_MMC_RX_INTERRUPT_RXMCGPIS_OFF (4u)

/** \brief Length for Ifx_GETH_MMC_RX_INTERRUPT_Bits.RXCRCERPIS */
#define IFX_GETH_MMC_RX_INTERRUPT_RXCRCERPIS_LEN (1u)

/** \brief Mask for Ifx_GETH_MMC_RX_INTERRUPT_Bits.RXCRCERPIS */
#define IFX_GETH_MMC_RX_INTERRUPT_RXCRCERPIS_MSK (0x1u)

/** \brief Offset for Ifx_GETH_MMC_RX_INTERRUPT_Bits.RXCRCERPIS */
#define IFX_GETH_MMC_RX_INTERRUPT_RXCRCERPIS_OFF (5u)

/** \brief Length for Ifx_GETH_MMC_RX_INTERRUPT_Bits.RXALGNERPIS */
#define IFX_GETH_MMC_RX_INTERRUPT_RXALGNERPIS_LEN (1u)

/** \brief Mask for Ifx_GETH_MMC_RX_INTERRUPT_Bits.RXALGNERPIS */
#define IFX_GETH_MMC_RX_INTERRUPT_RXALGNERPIS_MSK (0x1u)

/** \brief Offset for Ifx_GETH_MMC_RX_INTERRUPT_Bits.RXALGNERPIS */
#define IFX_GETH_MMC_RX_INTERRUPT_RXALGNERPIS_OFF (6u)

/** \brief Length for Ifx_GETH_MMC_RX_INTERRUPT_Bits.RXRUNTPIS */
#define IFX_GETH_MMC_RX_INTERRUPT_RXRUNTPIS_LEN (1u)

/** \brief Mask for Ifx_GETH_MMC_RX_INTERRUPT_Bits.RXRUNTPIS */
#define IFX_GETH_MMC_RX_INTERRUPT_RXRUNTPIS_MSK (0x1u)

/** \brief Offset for Ifx_GETH_MMC_RX_INTERRUPT_Bits.RXRUNTPIS */
#define IFX_GETH_MMC_RX_INTERRUPT_RXRUNTPIS_OFF (7u)

/** \brief Length for Ifx_GETH_MMC_RX_INTERRUPT_Bits.RXJABERPIS */
#define IFX_GETH_MMC_RX_INTERRUPT_RXJABERPIS_LEN (1u)

/** \brief Mask for Ifx_GETH_MMC_RX_INTERRUPT_Bits.RXJABERPIS */
#define IFX_GETH_MMC_RX_INTERRUPT_RXJABERPIS_MSK (0x1u)

/** \brief Offset for Ifx_GETH_MMC_RX_INTERRUPT_Bits.RXJABERPIS */
#define IFX_GETH_MMC_RX_INTERRUPT_RXJABERPIS_OFF (8u)

/** \brief Length for Ifx_GETH_MMC_RX_INTERRUPT_Bits.RXUSIZEGPIS */
#define IFX_GETH_MMC_RX_INTERRUPT_RXUSIZEGPIS_LEN (1u)

/** \brief Mask for Ifx_GETH_MMC_RX_INTERRUPT_Bits.RXUSIZEGPIS */
#define IFX_GETH_MMC_RX_INTERRUPT_RXUSIZEGPIS_MSK (0x1u)

/** \brief Offset for Ifx_GETH_MMC_RX_INTERRUPT_Bits.RXUSIZEGPIS */
#define IFX_GETH_MMC_RX_INTERRUPT_RXUSIZEGPIS_OFF (9u)

/** \brief Length for Ifx_GETH_MMC_RX_INTERRUPT_Bits.RXOSIZEGPIS */
#define IFX_GETH_MMC_RX_INTERRUPT_RXOSIZEGPIS_LEN (1u)

/** \brief Mask for Ifx_GETH_MMC_RX_INTERRUPT_Bits.RXOSIZEGPIS */
#define IFX_GETH_MMC_RX_INTERRUPT_RXOSIZEGPIS_MSK (0x1u)

/** \brief Offset for Ifx_GETH_MMC_RX_INTERRUPT_Bits.RXOSIZEGPIS */
#define IFX_GETH_MMC_RX_INTERRUPT_RXOSIZEGPIS_OFF (10u)

/** \brief Length for Ifx_GETH_MMC_RX_INTERRUPT_Bits.RX64OCTGBPIS */
#define IFX_GETH_MMC_RX_INTERRUPT_RX64OCTGBPIS_LEN (1u)

/** \brief Mask for Ifx_GETH_MMC_RX_INTERRUPT_Bits.RX64OCTGBPIS */
#define IFX_GETH_MMC_RX_INTERRUPT_RX64OCTGBPIS_MSK (0x1u)

/** \brief Offset for Ifx_GETH_MMC_RX_INTERRUPT_Bits.RX64OCTGBPIS */
#define IFX_GETH_MMC_RX_INTERRUPT_RX64OCTGBPIS_OFF (11u)

/** \brief Length for Ifx_GETH_MMC_RX_INTERRUPT_Bits.RX65T127OCTGBPIS */
#define IFX_GETH_MMC_RX_INTERRUPT_RX65T127OCTGBPIS_LEN (1u)

/** \brief Mask for Ifx_GETH_MMC_RX_INTERRUPT_Bits.RX65T127OCTGBPIS */
#define IFX_GETH_MMC_RX_INTERRUPT_RX65T127OCTGBPIS_MSK (0x1u)

/** \brief Offset for Ifx_GETH_MMC_RX_INTERRUPT_Bits.RX65T127OCTGBPIS */
#define IFX_GETH_MMC_RX_INTERRUPT_RX65T127OCTGBPIS_OFF (12u)

/** \brief Length for Ifx_GETH_MMC_RX_INTERRUPT_Bits.RX128T255OCTGBPIS */
#define IFX_GETH_MMC_RX_INTERRUPT_RX128T255OCTGBPIS_LEN (1u)

/** \brief Mask for Ifx_GETH_MMC_RX_INTERRUPT_Bits.RX128T255OCTGBPIS */
#define IFX_GETH_MMC_RX_INTERRUPT_RX128T255OCTGBPIS_MSK (0x1u)

