dturcu/illd_release_tc3x/src/BaseSw/Infra/Sfr/TC37xED/IfxGeth_bf.h
/** \brief Mask for Ifx_GETH_DMA_CH_CURRENT_APP_TXDESC_Bits.CURTDESAPTR */
#define IFX_GETH_DMA_CH_CURRENT_APP_TXDESC_CURTDESAPTR_MSK (0xffffffffu)

/** \brief Offset for Ifx_GETH_DMA_CH_CURRENT_APP_TXDESC_Bits.CURTDESAPTR */
#define IFX_GETH_DMA_CH_CURRENT_APP_TXDESC_CURTDESAPTR_OFF (0u)

/** \brief Length for Ifx_GETH_DMA_CH_CURRENT_APP_RXDESC_Bits.CURRDESAPTR */
#define IFX_GETH_DMA_CH_CURRENT_APP_RXDESC_CURRDESAPTR_LEN (32u)

/** \brief Mask for Ifx_GETH_DMA_CH_CURRENT_APP_RXDESC_Bits.CURRDESAPTR */
#define IFX_GETH_DMA_CH_CURRENT_APP_RXDESC_CURRDESAPTR_MSK (0xffffffffu)

/** \brief Offset for Ifx_GETH_DMA_CH_CURRENT_APP_RXDESC_Bits.CURRDESAPTR */
#define IFX_GETH_DMA_CH_CURRENT_APP_RXDESC_CURRDESAPTR_OFF (0u)

/** \brief Length for Ifx_GETH_DMA_CH_CURRENT_APP_TXBUFFER_Bits.CURTBUFAPTR */
#define IFX_GETH_DMA_CH_CURRENT_APP_TXBUFFER_CURTBUFAPTR_LEN (32u)

/** \brief Mask for Ifx_GETH_DMA_CH_CURRENT_APP_TXBUFFER_Bits.CURTBUFAPTR */
#define IFX_GETH_DMA_CH_CURRENT_APP_TXBUFFER_CURTBUFAPTR_MSK (0xffffffffu)

/** \brief Offset for Ifx_GETH_DMA_CH_CURRENT_APP_TXBUFFER_Bits.CURTBUFAPTR */
#define IFX_GETH_DMA_CH_CURRENT_APP_TXBUFFER_CURTBUFAPTR_OFF (0u)

/** \brief Length for Ifx_GETH_DMA_CH_CURRENT_APP_RXBUFFER_Bits.CURRBUFAPTR */
#define IFX_GETH_DMA_CH_CURRENT_APP_RXBUFFER_CURRBUFAPTR_LEN (32u)

/** \brief Mask for Ifx_GETH_DMA_CH_CURRENT_APP_RXBUFFER_Bits.CURRBUFAPTR */
#define IFX_GETH_DMA_CH_CURRENT_APP_RXBUFFER_CURRBUFAPTR_MSK (0xffffffffu)

/** \brief Offset for Ifx_GETH_DMA_CH_CURRENT_APP_RXBUFFER_Bits.CURRBUFAPTR */
#define IFX_GETH_DMA_CH_CURRENT_APP_RXBUFFER_CURRBUFAPTR_OFF (0u)

/** \brief Length for Ifx_GETH_DMA_CH_STATUS_Bits.TI */
#define IFX_GETH_DMA_CH_STATUS_TI_LEN (1u)

/** \brief Mask for Ifx_GETH_DMA_CH_STATUS_Bits.TI */
#define IFX_GETH_DMA_CH_STATUS_TI_MSK (0x1u)

/** \brief Offset for Ifx_GETH_DMA_CH_STATUS_Bits.TI */
#define IFX_GETH_DMA_CH_STATUS_TI_OFF (0u)

/** \brief Length for Ifx_GETH_DMA_CH_STATUS_Bits.TPS */
#define IFX_GETH_DMA_CH_STATUS_TPS_LEN (1u)

/** \brief Mask for Ifx_GETH_DMA_CH_STATUS_Bits.TPS */
#define IFX_GETH_DMA_CH_STATUS_TPS_MSK (0x1u)

/** \brief Offset for Ifx_GETH_DMA_CH_STATUS_Bits.TPS */
#define IFX_GETH_DMA_CH_STATUS_TPS_OFF (1u)

/** \brief Length for Ifx_GETH_DMA_CH_STATUS_Bits.TBU */
#define IFX_GETH_DMA_CH_STATUS_TBU_LEN (1u)

/** \brief Mask for Ifx_GETH_DMA_CH_STATUS_Bits.TBU */
#define IFX_GETH_DMA_CH_STATUS_TBU_MSK (0x1u)

/** \brief Offset for Ifx_GETH_DMA_CH_STATUS_Bits.TBU */
#define IFX_GETH_DMA_CH_STATUS_TBU_OFF (2u)

/** \brief Length for Ifx_GETH_DMA_CH_STATUS_Bits.RI */
#define IFX_GETH_DMA_CH_STATUS_RI_LEN (1u)

/** \brief Mask for Ifx_GETH_DMA_CH_STATUS_Bits.RI */
#define IFX_GETH_DMA_CH_STATUS_RI_MSK (0x1u)

/** \brief Offset for Ifx_GETH_DMA_CH_STATUS_Bits.RI */
#define IFX_GETH_DMA_CH_STATUS_RI_OFF (6u)

/** \brief Length for Ifx_GETH_DMA_CH_STATUS_Bits.RBU */
#define IFX_GETH_DMA_CH_STATUS_RBU_LEN (1u)

/** \brief Mask for Ifx_GETH_DMA_CH_STATUS_Bits.RBU */
#define IFX_GETH_DMA_CH_STATUS_RBU_MSK (0x1u)

/** \brief Offset for Ifx_GETH_DMA_CH_STATUS_Bits.RBU */
#define IFX_GETH_DMA_CH_STATUS_RBU_OFF (7u)

/** \brief Length for Ifx_GETH_DMA_CH_STATUS_Bits.RPS */
#define IFX_GETH_DMA_CH_STATUS_RPS_LEN (1u)

/** \brief Mask for Ifx_GETH_DMA_CH_STATUS_Bits.RPS */
#define IFX_GETH_DMA_CH_STATUS_RPS_MSK (0x1u)

/** \brief Offset for Ifx_GETH_DMA_CH_STATUS_Bits.RPS */
#define IFX_GETH_DMA_CH_STATUS_RPS_OFF (8u)

/** \brief Length for Ifx_GETH_DMA_CH_STATUS_Bits.RWT */
#define IFX_GETH_DMA_CH_STATUS_RWT_LEN (1u)

/** \brief Mask for Ifx_GETH_DMA_CH_STATUS_Bits.RWT */
#define IFX_GETH_DMA_CH_STATUS_RWT_MSK (0x1u)

/** \brief Offset for Ifx_GETH_DMA_CH_STATUS_Bits.RWT */
#define IFX_GETH_DMA_CH_STATUS_RWT_OFF (9u)

/** \brief Length for Ifx_GETH_DMA_CH_STATUS_Bits.ETI */
#define IFX_GETH_DMA_CH_STATUS_ETI_LEN (1u)

/** \brief Mask for Ifx_GETH_DMA_CH_STATUS_Bits.ETI */
#define IFX_GETH_DMA_CH_STATUS_ETI_MSK (0x1u)

/** \brief Offset for Ifx_GETH_DMA_CH_STATUS_Bits.ETI */
#define IFX_GETH_DMA_CH_STATUS_ETI_OFF (10u)

/** \brief Length for Ifx_GETH_DMA_CH_STATUS_Bits.ERI */
#define IFX_GETH_DMA_CH_STATUS_ERI_LEN (1u)

/** \brief Mask for Ifx_GETH_DMA_CH_STATUS_Bits.ERI */
#define IFX_GETH_DMA_CH_STATUS_ERI_MSK (0x1u)

/** \brief Offset for Ifx_GETH_DMA_CH_STATUS_Bits.ERI */
#define IFX_GETH_DMA_CH_STATUS_ERI_OFF (11u)

/** \brief Length for Ifx_GETH_DMA_CH_STATUS_Bits.FBE */
#define IFX_GETH_DMA_CH_STATUS_FBE_LEN (1u)

/** \brief Mask for Ifx_GETH_DMA_CH_STATUS_Bits.FBE */
#define IFX_GETH_DMA_CH_STATUS_FBE_MSK (0x1u)

/** \brief Offset for Ifx_GETH_DMA_CH_STATUS_Bits.FBE */
#define IFX_GETH_DMA_CH_STATUS_FBE_OFF (12u)

/** \brief Length for Ifx_GETH_DMA_CH_STATUS_Bits.CDE */
#define IFX_GETH_DMA_CH_STATUS_CDE_LEN (1u)

/** \brief Mask for Ifx_GETH_DMA_CH_STATUS_Bits.CDE */
#define IFX_GETH_DMA_CH_STATUS_CDE_MSK (0x1u)

/** \brief Offset for Ifx_GETH_DMA_CH_STATUS_Bits.CDE */
#define IFX_GETH_DMA_CH_STATUS_CDE_OFF (13u)

/** \brief Length for Ifx_GETH_DMA_CH_STATUS_Bits.AIS */
#define IFX_GETH_DMA_CH_STATUS_AIS_LEN (1u)

/** \brief Mask for Ifx_GETH_DMA_CH_STATUS_Bits.AIS */
#define IFX_GETH_DMA_CH_STATUS_AIS_MSK (0x1u)

/** \brief Offset for Ifx_GETH_DMA_CH_STATUS_Bits.AIS */
#define IFX_GETH_DMA_CH_STATUS_AIS_OFF (14u)

/** \brief Length for Ifx_GETH_DMA_CH_STATUS_Bits.NIS */
#define IFX_GETH_DMA_CH_STATUS_NIS_LEN (1u)

/** \brief Mask for Ifx_GETH_DMA_CH_STATUS_Bits.NIS */
#define IFX_GETH_DMA_CH_STATUS_NIS_MSK (0x1u)

/** \brief Offset for Ifx_GETH_DMA_CH_STATUS_Bits.NIS */
#define IFX_GETH_DMA_CH_STATUS_NIS_OFF (15u)

/** \brief Length for Ifx_GETH_DMA_CH_STATUS_Bits.TEB */
#define IFX_GETH_DMA_CH_STATUS_TEB_LEN (3u)

/** \brief Mask for Ifx_GETH_DMA_CH_STATUS_Bits.TEB */
#define IFX_GETH_DMA_CH_STATUS_TEB_MSK (0x7u)

/** \brief Offset for Ifx_GETH_DMA_CH_STATUS_Bits.TEB */
#define IFX_GETH_DMA_CH_STATUS_TEB_OFF (16u)

/** \brief Length for Ifx_GETH_DMA_CH_STATUS_Bits.REB */
#define IFX_GETH_DMA_CH_STATUS_REB_LEN (3u)

/** \brief Mask for Ifx_GETH_DMA_CH_STATUS_Bits.REB */
#define IFX_GETH_DMA_CH_STATUS_REB_MSK (0x7u)

